In [1]:
# Import Data Manipulation Library
import pandas as pd 
import numpy as np

In [2]:
# Define a series : 1D Array

a = pd.Series([1,2,3,4,5])
print(a)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [6]:
b =pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
b

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [7]:
b =pd.Series([1,2,3,4,5],index = ['a','b','c','d','e'])
print(b)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
# Using Concept of Indexing
print(a.dtype)
print(a[4])
print(b['d'])

int64
5
4

C:\Users\admin\AppData\Local\Temp\ipykernel_5060\1368999294.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(a[4])

In [12]:
# 2D
c = pd.DataFrame({'India':[2000],'USA':[3000],
                 'UK':[3500]})
print(c)

   India   USA    UK
0   2000  3000  3500

In [13]:
# Create Student Database
database = {'Name':['Nikhil','Aniket','Mihir','Tanvi','Hemangi'],
            'Age':[10,11,12,13,14],
            'Marks':[34,56,67,34,56],
            'CGPA':[8,6,9,6,8]
            }

# Create a variable df: which will store dataframe
df = pd.DataFrame(database)
print(df)

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     34     6
4  Hemangi   14     56     8

In [14]:
df

      Name  Age  Marks  CGPA
0   Nikhil   10     34     8
1   Aniket   11     56     6
2    Mihir   12     67     9
3    Tanvi   13     34     6
4  Hemangi   14     56     8

In [16]:
df[df['Name']=='Tanvi']

    Name  Age  Marks  CGPA
3  Tanvi   13     34     6

In [18]:
df[df['Name']== 'Aniket']

     Name  Age  Marks  CGPA
1  Aniket   11     56     6

In [19]:
# Usinf agg() : Agreegate Function
df['Marks'].agg(['min','max','mean'])

min     34.0
max     67.0
mean    49.4
Name: Marks, dtype: float64

In [21]:
df[df['Marks']== 67]

    Name  Age  Marks  CGPA
2  Mihir   12     67     9

In [23]:
df[df['CGPA']== 6]

     Name  Age  Marks  CGPA
1  Aniket   11     56     6
3   Tanvi   13     34     6

In [24]:
# Checking DataFrame Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     5 non-null      int64
 2   Marks   5 non-null      int64
 3   CGPA    5 non-null      int64
dtypes: int64(3), object(1)
memory usage: 292.0+ bytes

In [25]:
# This code will check if any missing value in dataset
df.isnull().sum()

Name     0
Age      0
Marks    0
CGPA     0
dtype: int64

In [26]:
print(df['Marks'].sum())
print(df['Marks'].mean())
print(df['Marks'].max())
print(df['Marks'].min())
print(df['Marks'].nunique())
print(df['Marks'].unique())
print(df['Name'].value_counts())
print(df['Marks'].value_counts())

247
49.4
67
34
3
[34 56 67]
Name
Nikhil     1
Aniket     1
Mihir      1
Tanvi      1
Hemangi    1
Name: count, dtype: int64
Marks
34    2
56    2
67    1
Name: count, dtype: int64

In [27]:
# Create Student Database
company = {'Name':['Ram','Om','Raj','Manoj','Puja','Aarvi','Kumar','Jay'],
            'Salary':[10000,20000,30000,40000,50000,60000,70000,80000],
            'No_of_Exp':[4,5,9,2,7,1,3,8],
            'Domain':['Tech','R&D','R&D','Tech','NonTech','Tech','R&D','NonTech'],
            'Age':[26,29,35,23,31,21,25,27],
            'Gender':['Male','Male','Male','Male','Female','Female','Male','Male']
            }

# Create a variable df: which will store dataframe
df = pd.DataFrame(company)
print(df)

    Name  Salary  No_of_Exp   Domain  Age  Gender
0    Ram   10000          4     Tech   26    Male
1     Om   20000          5      R&D   29    Male
2    Raj   30000          9      R&D   35    Male
3  Manoj   40000          2     Tech   23    Male
4   Puja   50000          7  NonTech   31  Female
5  Aarvi   60000          1     Tech   21  Female
6  Kumar   70000          3      R&D   25    Male
7    Jay   80000          8  NonTech   27    Male

In [28]:
# Checking Dataset Information
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Name       8 non-null      object
 1   Salary     8 non-null      int64
 2   No_of_Exp  8 non-null      int64
 3   Domain     8 non-null      object
 4   Age        8 non-null      int64
 5   Gender     8 non-null      object
dtypes: int64(3), object(3)
memory usage: 516.0+ bytes

In [47]:
# Evaluting the Max number of Exp From the Dataset
df[df['No_of_Exp']== max]
print(df['No_of_Exp'].max())

9

In [ ]:
# Evaluting the Min number of Exp From the Dataset
df[df['No_of_Exp']== 'min']
print(df['No_of_Exp'].min())

1

In [49]:
# Evaluting the Min number of Exp From the Dataset
df[df['No_of_Exp']== 'mean']
print(df['No_of_Exp'].mean())

4.875

In [ ]:
# Data of Female Employee
df[df['Gender']== 'Female']

    Name  Salary  No_of_Exp   Domain  Age  Gender
4   Puja   50000          7  NonTech   31  Female
5  Aarvi   60000          1     Tech   21  Female

In [ ]:
# Data of Higest Salary Female Employee
f = df[df['Gender']== 'Female']
f['Salary'].max()
f[f['Salary']== 60000]

    Name  Salary  No_of_Exp Domain  Age  Gender
5  Aarvi   60000          1   Tech   21  Female

In [ ]:
# Count of Gender
df['Gender'].value_counts()

Gender
Male      6
Female    2
Name: count, dtype: int64